[
    {
        "type": "text-section",
        "titleText": "About Me",
        "mainText": "Hello! My name is Martín Anselmo. I am a 25 year old software engineer from Chile. I just finished my degree at Politecnico Di Milano, in the field of Computer Science and Engineering. \nMy interests in the area are a mix of good software and data visualization. In particular, I enjoy web development and keeping up with the latest technologies."
    },
    {
        "type": "text-section",
        "titleText": "Education",
        "mainText": "As I mentioned before, I am currently doing a double degree at Politecnico Di Milano (Polimi) and Pontificia Universidad Catolica de Chile (PUC). This means that after I completed bachelor's at PUC, I started a MSc degree at Polimi while continuing my studies at PUC, so I can get the titles from both universities.\nAt PUC, I got a standard engineering bachelor's degree, with a major in computer science and a minor in data science, and at Polimi, I did a MSc in computer science, with a focus in data science and big data."
    },
    {
        "type": "list-section",
        "titleText": "Technical Skills",
        "optionalDescriptionText": "My interests are quite a bit varied, including software engineering and data science, and my skills reflect that. What I like about both worlds is that one is more focused on getting results, while the other is in charge of showing them. \nFrom a technical point of view, my skills include the following:",
        "itemList": [
            {
                "type": "nested",
                "title": "Programming Languages",
                "content": [
                    {
                        "type": "simple",
                        "content": "Python (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "Javascript/Typescript (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "C/C++ (medium)"
                    },
                    {
                        "type": "simple",
                        "content": "ruby (medium)"
                    }
                ]
            },
            {
                "type": "nested",
                "title": "Data science frameworks/tools",
                "content": [
                    {
                        "type": "simple",
                        "content": "Pandas (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "Numpy (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "Sklearn (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "SQL (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "D3.js (medium)"
                    }
                ]
            },
            {
                "type": "nested",
                "title": "Web and Mobile development framework/tools",
                "content": [
                    {
                        "type": "simple",
                        "content": "React (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "Vue (advanced)"
                    },
                    {
                        "type": "simple",
                        "content": "Ruby on Rails (advanced)"
                    }
                ]
            },
            {
                "type": "nested",
                "title": "Other",
                "content": [
                    {
                        "type": "simple",
                        "content": "GIT (advanced)"
                    }
                ]
            }
        ]
    },
    {
        "type": "text-section",
        "titleText": "Other interests",
        "mainText": "Apart from programming, my hobbies involve sports, cooking and music. In the sports side, I like and play tennis, padel, skiing and some golf. In the music related field, I love playing guitar, and more recently I have started the hobby of diy pedal making (which involves quite a bit of electronics).\n"
    }
]